leetcode_296_best_meeting_point.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 296. Best Meeting Point</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 296. Best Meeting Point</h1>
<p>
<a href="https://leetcode.com/problems/best-meeting-point/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="mistake_wrong_time_complexity.html#ID-AF523FD7-71A3-44F0-B9F2-E288B8A6EB6D">Mistake: Wrong time complexity</a>.  First solution was \(O(n^4)\).</li>

<li><a href="can_you_break_down_the_problem_in_small_and_easily_to_solve_parts.html#ID-69D68202-BF1A-4D72-A0EC-DDCBAF112500">Can we break-down the problem in small and easily to solve parts?</a>  The total sum can be split on the total distance by axis.  Therefore, the problem is returning the sum of these independent sums.  Time complexity is \(O(\max(n \times m, n^2, m^2))\) and space complexity is \(O(n + m)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minTotalDistance</span>(<span style="font-weight: bold;">self</span>, g: List[List[<span style="font-weight: bold;">int</span>]]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(g)
        <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(g[0])
        <span style="font-weight: bold; font-style: italic;">cfreq</span> = [0] * M
        <span style="font-weight: bold; font-style: italic;">rfreq</span> = [0] * N
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
                <span style="font-weight: bold; font-style: italic;">cfreq</span>[<span style="font-weight: bold; font-style: italic;">j</span>] += g[i][j]
                <span style="font-weight: bold; font-style: italic;">rfreq</span>[<span style="font-weight: bold; font-style: italic;">i</span>] += g[i][j]

        <span style="font-weight: bold; font-style: italic;">x</span> = <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>)
        <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
            <span style="font-weight: bold; font-style: italic;">cur</span> = 0
            <span style="font-weight: bold;">for</span> k <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
                <span style="font-weight: bold;">if</span> j != <span style="font-weight: bold; font-style: italic;">k</span>:
                    cur += cfreq[k] * <span style="font-weight: bold;">abs</span>(k - j)
            <span style="font-weight: bold; font-style: italic;">x</span> = <span style="font-weight: bold;">min</span>(x, cur)

        <span style="font-weight: bold; font-style: italic;">y</span> = <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>)
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold; font-style: italic;">cur</span> = 0
            <span style="font-weight: bold;">for</span> k <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
                <span style="font-weight: bold;">if</span> i != <span style="font-weight: bold; font-style: italic;">k</span>:
                    cur += rfreq[k] * <span style="font-weight: bold;">abs</span>(k - i)
            <span style="font-weight: bold; font-style: italic;">y</span> = <span style="font-weight: bold;">min</span>(y, cur)

        <span style="font-weight: bold;">return</span> x + y


<span style="font-weight: bold;">assert</span> (
    Solution().minTotalDistance([[1, 0, 0, 0, 1], [0, 0, 0, 0, 0], [0, 0, 1, 0, 0]])
    == 6
)
<span style="font-weight: bold;">assert</span> Solution().minTotalDistance([[1, 1]]) == 1
</pre>
</div>
</div>
</body>
</html>